In [2]:
import pandas as pd

In [21]:
#defining data frame
weather_data = {'s_no':[1,2,3,4],
               'name':['raj','ram','rao','rak']}
df=pd.DataFrame(weather_data)
df

   s_no name
0     1  raj
1     2  ram
2     3  rao
3     4  rak

In [27]:
#reading data from csv
df=pd.read_csv(r"C:\Users\rajesh\Rajesh_Python_Jupyter_Study\.ipynb_checkpoints\train.csv")
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [25]:
#finding the data dimension for the dataframe
df.shape

(891, 12)

In [28]:
#providing rows and columns seperately
rows,columns=df.shape
print('rows:',rows,'columns:',columns)

rows: 891 columns: 12

In [29]:
#print only selected lines
df[2:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.100,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S

In [31]:
#print only 2 columns data
df[['Name','Sex']].head()

                                                Name     Sex
0                            Braund, Mr. Owen Harris    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                             Heikkinen, Miss. Laina  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                           Allen, Mr. William Henry    male

In [35]:
# print the unique records count for the specific column
df.Sex.unique()

array(['male', 'female'], dtype=object)

In [42]:
# print max value for a specific column
maxage = df.Age.max()
print("Max Age : ", maxage)

Max Age :  80.0

In [50]:
print("Mean : ", df.Age.mean())
print("SD : ", df.Age.std())
print("Min Age : ", df.Age.min())
print("Max Age : ", df.Age.max())
print("DESCRIBE DATAFRAME : ")
print(df.describe())

Mean :  29.69911764705882
SD :  14.526497332334044
Min Age :  0.42
Max Age :  80.0
DESCRIBE DATAFRAME :
       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

In [52]:
df[df.Age > 70]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [72]:
df[['PassengerId','Name','Sex','Fare']] [df.Age == df.Age.max()]

     PassengerId                                  Name   Sex  Fare
630          631  Barkworth, Mr. Algernon Henry Wilson  male  30.0

In [73]:
#  More Details about PANDAS Operations:   https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html

In [76]:
df.index

RangeIndex(start=0, stop=891, step=1)

In [157]:
df=pd.read_csv(r"C:\Users\rajesh\Rajesh_Python_Jupyter_Study\.ipynb_checkpoints\train.csv")
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [155]:
df.index

RangeIndex(start=0, stop=891, step=1)

In [158]:
df.reset_index(inplace=True)

In [159]:
df.set_index('male',inplace=True)

KeyError: 'male'

In [147]:
df.loc(1)